// Случайное число от min до max
// важность: 2
// Встроенный метод Math.random() возвращает случайное число от 0 (включительно) до 1 (но не включая 1)
//
// Напишите функцию random(min, max), которая генерирует случайное число с плавающей точкой от min до max (но не включая max).
//
// Пример работы функции:
//
//     alert( random(1, 5) ); // 1.2345623452
// alert( random(1, 5) ); // 3.7894332423
// alert( random(1, 5) ); // 4.3435234525


function random(min, max){
    return min + Math.random() * (max - min)
}

alert( random(1, 5).toFixed() );
alert( random(1, 5) );
alert( random(1, 5) )
//
//
// Нам нужно преобразовать каждое значение из интервала 0…1 в значения от min до max.
//
//     Это можно сделать в 2 шага:
//
//     Если мы умножим случайное число от 0…1 на max-min, тогда интервал возможных значений от 0..1 увеличивается до 0..max-min.
//     И, если мы прибавим min, то интервал станет от min до max.;